In [51]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [52]:
orders1=pd.read_csv('restaurant-1-orders.csv',parse_dates=['Order Date'],dayfirst=True)
orders1.columns=['order_number','date','item_name','quantity','product_price','total_products']
prices1=pd.read_csv('restaurant-1-products-price.csv')
prices1.columns=['item_name','product_price']

In [53]:
orders1.head()

,order_number,date,item_name,quantity,product_price,total_products
0,16118,2019-08-03 20:25:00,Plain Papadum,2,0.80,6
1,16118,2019-08-03 20:25:00,King Prawn Balti,1,12.95,6
2,16118,2019-08-03 20:25:00,Garlic Naan,1,2.95,6
3,16118,2019-08-03 20:25:00,Mushroom Rice,1,3.95,6
4,16118,2019-08-03 20:25:00,Paneer Tikka Masala,1,8.95,6

In [54]:
prices1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 248 entries, 0 to 247
Data columns (total 2 columns):
item_name        248 non-null object
product_price    248 non-null float64
dtypes: float64(1), object(1)
memory usage: 4.0+ KB

In [55]:
OrderPrices=orders1.quantity.mul(orders1.product_price).groupby(orders1.order_number).sum().reset_index(name='total_price')
orders1=orders1.merge(OrderPrices,how='left',on='order_number')

In [56]:
orders1.head()

,order_number,date,item_name,quantity,product_price,total_products,total_price
0,16118,2019-08-03 20:25:00,Plain Papadum,2,0.80,6,30.9
1,16118,2019-08-03 20:25:00,King Prawn Balti,1,12.95,6,30.9
2,16118,2019-08-03 20:25:00,Garlic Naan,1,2.95,6,30.9
3,16118,2019-08-03 20:25:00,Mushroom Rice,1,3.95,6,30.9
4,16118,2019-08-03 20:25:00,Paneer Tikka Masala,1,8.95,6,30.9

In [57]:
ordDate=orders1.groupby('order_number')[['date','total_products','total_price']].max()

In [58]:
ordDate.head()

                            date  total_products  total_price
order_number
630          2015-09-01 14:42:00               3         3.95
647          2015-09-08 17:12:00               3         3.95
648          2015-09-08 17:31:00               1         3.95
651          2015-09-08 17:56:00               4         3.95
764          2015-09-09 09:31:00               3         3.95

In [59]:
orders1.loc[orders1.order_number == 4490 ]

,order_number,date,item_name,quantity,product_price,total_products,total_price
9285,4490,2017-02-07 17:40:00,Plain Papadum,3,0.80,8,57.7
14771,4490,2017-02-07 17:40:00,Plain Naan,1,2.60,8,57.7
37485,4490,2017-02-07 17:40:00,Special Fried Rice,1,3.95,8,57.7
41534,4490,2017-02-07 17:40:00,Prawn Puree,1,4.95,8,57.7
49423,4490,2017-02-07 17:40:00,Saag Aloo,1,5.95,8,57.7
73202,4490,2017-02-07 17:40:00,Tandoori Mixed Grill,1,11.95,8,57.7
74462,4490,2017-02-07 17:40:00,King Prawn Shaslick,1,12.95,8,57.7
74463,4490,2017-02-07 17:40:00,Bengal King Prawn,1,12.95,8,57.7

In [60]:
test=orders1.groupby('order_number').agg( sumcount=('quantity','sum') , count=('product_price','count'), total_products=('total_products','min') )

In [61]:
orders1.loc[orders1.order_number==647]

,order_number,date,item_name,quantity,product_price,total_products,total_price
39151,647,2015-09-08 17:12:00,Onion Bhaji,1,3.95,3,3.95

In [62]:
test.loc[test.sumcount != test.total_products].count()

sumcount          6878
count             6878
total_products    6878
dtype: int64

In [63]:
orders1.count()

order_number      74818
date              74818
item_name         74818
quantity          74818
product_price     74818
total_products    74818
total_price       74818
dtype: int64